<br>

![Imgur](https://i.imgur.com/zRrFdsf.png)

_____

# DATA FRAMES IN Python

**Data frames**  are more complex containers of values. The most common analogy is a spreadsheet.

## 1. Creating

In [4]:
namesP=["Qing", "Françoise", "Raúl", "Bjork","Marie"]
agesP=[32,33,28,30,29]
countryP=["China", "Senegal", "España", "Norway","Korea"]
educationP=["Bach", "Bach", "Master", "PhD","PhD"]

classroomP=dict(student=namesP,age=agesP,edu=educationP,country=countryP)

import pandas as pd

# our data frame:
studentsP=pd.DataFrame(classroomP)
## see it:
studentsP

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Raúl   28  Master   España
3      Bjork   30     PhD   Norway
4      Marie   29     PhD    Korea

## 2. Accessing

In [5]:
studentsP.iloc[:,0] # ":" means 'all'; "iloc" requests positions (indices)

0         Qing
1    Françoise
2         Raúl
3        Bjork
4        Marie
Name: student, dtype: object

In [6]:
studentsP.iloc[:,[1,2]] # indices in a list

   age     edu
0   32    Bach
1   33    Bach
2   28  Master
3   30     PhD
4   29     PhD

In [7]:
studentsP.loc[:,'student'] # "loc" requires labels (not positions)

0         Qing
1    Françoise
2         Raúl
3        Bjork
4        Marie
Name: student, dtype: object

In [8]:
studentsP.loc[:,['student','edu']]

     student     edu
0       Qing    Bach
1  Françoise    Bach
2       Raúl  Master
3      Bjork     PhD
4      Marie     PhD

In [9]:
studentsP.student # one column in Pandas

0         Qing
1    Françoise
2         Raúl
3        Bjork
4        Marie
Name: student, dtype: object

In [10]:
studentsP.loc[2,'student'] # row with label 2, info about 'student'

'Raúl'

In [11]:
studentsP.iloc[2,0] # row with position 2, info about 'student'

'Raúl'

In [12]:
studentsP.loc[[2,4],['student','edu']]

  student     edu
2    Raúl  Master
4   Marie     PhD

## 3. Replacing

In [13]:
studentsP.loc[2,'student']='Lito'
studentsP

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Lito   28  Master   España
3      Bjork   30     PhD   Norway
4      Marie   29     PhD    Korea

In [14]:
studentsP.loc[[2,4],'age']=[32,31]
studentsP

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Lito   32  Master   España
3      Bjork   30     PhD   Norway
4      Marie   31     PhD    Korea

## 4. Deleting

In [15]:
# make copy
studentsP_new=studentsP.copy()

### Deleting rows

In [16]:
byeRows=[2,3]
studentsP_new

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Lito   32  Master   España
3      Bjork   30     PhD   Norway
4      Marie   31     PhD    Korea

In [17]:
studentsP_new.drop(index=byeRows)

     student  age   edu  country
0       Qing   32  Bach    China
1  Françoise   33  Bach  Senegal
4      Marie   31   PhD    Korea

In [18]:
newDF=studentsP_new.drop(index=byeRows)
newDF

     student  age   edu  country
0       Qing   32  Bach    China
1  Françoise   33  Bach  Senegal
4      Marie   31   PhD    Korea

In [19]:
studentsP_new

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Lito   32  Master   España
3      Bjork   30     PhD   Norway
4      Marie   31     PhD    Korea

In [20]:
studentsP_new.drop(index=byeRows,inplace=True) #inplace=inmediately
#then
studentsP_new

     student  age   edu  country
0       Qing   32  Bach    China
1  Françoise   33  Bach  Senegal
4      Marie   31   PhD    Korea

In [21]:
studentsP_new.loc[2,:]

KeyError: 2

As you see, the indexes dissapeared. Then, you should reset the indexes:

In [ ]:
studentsP_new.reset_index(drop=True,inplace=True)
#then
studentsP_new

### Deleting columns

In [ ]:
# This is what you want get rid of:
byeColumns=['edu'] # you can delete more than one

#this is the result
studentsP_new.drop(columns=byeColumns,inplace=True)
#then
studentsP_new

### Deleting cells

In [ ]:
studentsP_new.loc[2,'country']=pd.NA
#then
studentsP_new

## Inserting

In [22]:
#currently
studentsP

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Lito   32  Master   España
3      Bjork   30     PhD   Norway
4      Marie   31     PhD    Korea

In [23]:
femaleP=[True,True,False,False,True]
studentsP1=studentsP.assign(female=femaleP)
#then
studentsP1

     student  age     edu  country  female
0       Qing   32    Bach    China    True
1  Françoise   33    Bach  Senegal    True
2       Lito   32  Master   España   False
3      Bjork   30     PhD   Norway   False
4      Marie   31     PhD    Korea    True

In [24]:
#another way
studentsP2=studentsP.copy()
studentsP2['female']=femaleP
#then
studentsP2

     student  age     edu  country  female
0       Qing   32    Bach    China    True
1  Françoise   33    Bach  Senegal    True
2       Lito   32  Master   España   False
3      Bjork   30     PhD   Norway   False
4      Marie   31     PhD    Korea    True

In [25]:
#yet another way
studentsP3=studentsP.copy()
studentsP3.loc[:,'female']=femaleP
studentsP3

     student  age     edu  country  female
0       Qing   32    Bach    China    True
1  Françoise   33    Bach  Senegal    True
2       Lito   32  Master   España   False
3      Bjork   30     PhD   Norway   False
4      Marie   31     PhD    Korea    True

## Other basic operations

In [26]:
# data of structure: list? tuple? dataframe?
type(studentsP)

pandas.core.frame.DataFrame

In [27]:
# type of data in data frame column
studentsP.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   student  5 non-null      object
 1   age      5 non-null      int64
 2   edu      5 non-null      object
 3   country  5 non-null      object
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes

In [28]:
# number of rows and columns
studentsP.shape

(5, 4)

In [29]:
# number of rows:
len(studentsP)

5

In [30]:
# first rows
studentsP.head(2) # compare with: studentsP.tail(2)

     student  age   edu  country
0       Qing   32  Bach    China
1  Françoise   33  Bach  Senegal

In [31]:
# name of columns
studentsP.columns

Index(['student', 'age', 'edu', 'country'], dtype='object')

## Queries

In [32]:
studentsP1.iloc[0,1]=33
studentsP1

     student  age     edu  country  female
0       Qing   33    Bach    China    True
1  Françoise   33    Bach  Senegal    True
2       Lito   32  Master   España   False
3      Bjork   30     PhD   Norway   False
4      Marie   31     PhD    Korea    True

In [33]:
#who is the oldest?

studentsP1[studentsP1.age==max(studentsP1.age)]

     student  age   edu  country  female
0       Qing   33  Bach    China    True
1  Françoise   33  Bach  Senegal    True

In [34]:
studentsP1[studentsP1.age==studentsP1.age.max()]['student']

0         Qing
1    Françoise
Name: student, dtype: object

In [35]:
#who has PhD?

studentsP1[studentsP1.edu=='PhD']

  student  age  edu country  female
3   Bjork   30  PhD  Norway   False
4   Marie   31  PhD   Korea    True

In [36]:
#who has PhD or Master?
studentsP1[studentsP1.edu.isin(['PhD','Master'])]

  student  age     edu country  female
2    Lito   32  Master  España   False
3   Bjork   30     PhD  Norway   False
4   Marie   31     PhD   Korea    True

In [37]:
#who does not has PhD or Master?
studentsP1[~studentsP1.edu.isin(['PhD','Master'])]

     student  age   edu  country  female
0       Qing   33  Bach    China    True
1  Françoise   33  Bach  Senegal    True

In [38]:
#the youngest female
studentsP1[studentsP1.female]

     student  age   edu  country  female
0       Qing   33  Bach    China    True
1  Françoise   33  Bach  Senegal    True
4      Marie   31   PhD    Korea    True

In [ ]:
studentsP1[studentsP1.female].sort_values(by=['age'],ascending=True).iloc[0,0]

In [ ]:
studentsP1

In [ ]:
studentsP1[studentsP1.female & studentsP1.age==studentsP1.age.min()]

In [ ]:
femdf=studentsP1[studentsP1.female]
femdf

In [ ]:
femdf[femdf.age==femdf.age.min()]

In [ ]:
femdf[femdf.age==femdf.age.min()]['student']